Repository: LeetaoGoooo/PromptHub
Catalog: prompthub/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: (Build %@)
zh_hans: （构建 %@）

# %lld of %lld models selected
source: %1$lld of %2$lld models selected
zh_hans: 已选择 %1$lld 个模型，共 %2$lld 个

source: About
zh_hans: 关于

source: Add context, notes, and personal insights directly to your prompts for better organization.
zh_hans: 直接向提示词添加上下文、笔记和个人见解，以便更好地组织。

source: AI
zh_hans: 人工智能

source: All
zh_hans: 全部

source: All Prompts
zh_hans: 所有提示词

source: API Key
zh_hans: API 密钥

source: API token required
zh_hans: 需要 API 令牌

source: Are you sure you want to delete '%@'?
zh_hans: 确定要删除'%@'吗？

source: Are you sure you want to delete '%@'? This action cannot be undone and will remove it from the public gallery.
zh_hans: 确定要删除'%@'吗？此操作无法撤销，并将从公共画廊中移除。

source: Are you sure you want to delete '%@'? This action cannot be undone.
zh_hans: 确定要删除'%@'吗？此操作无法撤销。

source: Are you sure you want to delete this prompt?
zh_hans: 确定要删除这个提示词吗？

source: Are you sure you want to delete version %lld?
zh_hans: 确定要删除版本 %lld 吗？

source: Are you sure you want to quit?
zh_hans: 确定要退出吗？

source: Attach example outputs to your prompts to instantly visualize their results.
zh_hans: 为您的提示词附上示例输出，以便即时可视化其结果。

source: Attachment
zh_hans: 附件

source: Attachment %lld
zh_hans: 附件 %lld

source: Attachments
zh_hans: 附件

source: Attachments:
zh_hans: 附件：

source: Base URL (OpenAI API)
zh_hans: 基础 URL (OpenAI API)

source: Bookmark data is stale. Consider re-selecting the file.
zh_hans: 书签数据已过期。请考虑重新选择文件。

source: Can't open: %@
zh_hans: 无法打开：%@

source: Cancel
zh_hans: 取消

source: Choose one or more models to test
zh_hans: 选择一个或多个模型进行测试

source: Clear All
zh_hans: 清除全部

source: Click 'All Prompts' to browse all prompts, or select a specific prompt to view details
zh_hans: 点击"所有提示词"浏览所有提示词，或选择特定提示词查看详情

source: Click the "+" button in the sidebar to create your first prompt
zh_hans: 点击左侧边栏的"+"按钮创建您的第一个提示词

source: Close
zh_hans: 关闭

source: Close comparison view
zh_hans: 关闭对比视图

source: Community Shared Prompts
zh_hans: 社区共享提示词

source: Compare
zh_hans: 对比

source: Compare All
zh_hans: 全部对比

source: Compare All Results
zh_hans: 对比所有结果

source: Compare Results
zh_hans: 对比结果

source: Compare the outputs of original and refactored prompts
zh_hans: 对比原始和重构提示词的输出结果

source: Configure
zh_hans: 配置

source: Confirm Delete
zh_hans: 确认删除

source: Copied to clipboard
zh_hans: 已复制到剪贴板

source: Copied!
zh_hans: 已复制！

source: Copy
zh_hans: 复制

source: Copy Content
zh_hans: 复制内容

source: Copy Prompt
zh_hans: 复制提示词

source: Copy Prompt Failed
zh_hans: 复制提示词失败

source: Copy Prompt Succeed
zh_hans: 复制提示词成功

source: Copy result to clipboard
zh_hans: 复制结果到剪贴板

source: Copy Share Link
zh_hans: 复制分享链接

source: Copy Share Link Failed
zh_hans: 复制分享链接失败

source: Copyright @ 2025 leetao
zh_hans: 版权所有 @ 2025 leetao

source: Could not create share URL
zh_hans: 无法创建分享链接

source: Could not determine content type for dropped file.
zh_hans: 无法确定拖放文件的内容类型。

source: Could not find prompts file
zh_hans: 找不到提示词文件

source: Create Share Link Failed
zh_hans: 创建分享链接失败

source: Created: %@
zh_hans: 创建时间: %@

source: Curated Prompt Gallery
zh_hans: 精选提示词画廊

source: Deletable Image Demo
zh_hans: 可删除图片演示

source: Delete
zh_hans: 删除

source: Delete Prompt
zh_hans: 删除提示词

source: Delete Shared Creation
zh_hans: 删除共享创作

source: Description
zh_hans: 描述

source: Dismiss
zh_hans: 关闭

source: Done
zh_hans: 完成

source: Dropped file is not an image type. Detected type: %@
zh_hans: 拖放的文件不是图片类型。检测到的类型: %@

source: Easily remember and reference where your valuable prompts came from.
zh_hans: 轻松记住并引用您宝贵提示词的来源。

source: Edit
zh_hans: 编辑

source: Edit Prompt
zh_hans: 编辑提示词

source: Effortless Prompt Sharing
zh_hans: 轻松分享提示词

source: Enhanced Prompt Details
zh_hans: 增强的提示词详情

source: Enter your Base URL
zh_hans: 输入您的基础 URL

source: Enter your OpenAI API Key
zh_hans: 输入您的 OpenAI API 密钥

source: Enter your test input here...
zh_hans: 在此输入您的测试内容...

source: Error getting resource values for dropped file: %@
zh_hans: 获取拖放文件的资源值出错: %@

source: Error loading image data: %@
zh_hans: 加载图片数据出错: %@

source: Error loading item as NSURL/URL: %@
zh_hans: 加载项目为 NSURL/URL 出错: %@

source: Error loading or parsing agents.json: %@
zh_hans: 加载或解析 agents.json 出错: %@

source: Error occurred
zh_hans: 发生错误

source: Error publishing prompt: %@
zh_hans: 发布提示词错误：%@

source: Error resolving bookmark data: %@
zh_hans: 解析书签数据出错: %@

source: Error saving shared item: %@
zh_hans: 保存共享项目错误：%@

source: Error selecting file: %@
zh_hans: 选择文件出错: %@

source: Error: %@
zh_hans: 错误：%@

source: Error: Could not create NSImage from URL: %@
zh_hans: 错误: 无法从 URL 创建 NSImage: %@

source: Error: Could not load image from data.
zh_hans: 错误：无法从数据加载图片。

source: Existing Share Link Copied
zh_hans: 已复制现有分享链接

source: Explore
zh_hans: 漫游

source: Explore a growing collection of pre-built prompts to kickstart your creativity and ideas (thanks cherry studio).
zh_hans: 探索不断增长的预建提示词集合，激发您的创造力和想法（感谢 cherry studio）。

source: Failed to delete prompt
zh_hans: 删除提示词失败

source: Failed to load prompts: %@
zh_hans: 加载提示词失败: %@

source: Failed to save prompt: %@
zh_hans: 保存提示词失败: %@

source: General
zh_hans: 通用

source: General Settings
zh_hans: 通用设置

source: Generating...
zh_hans: 生成中...

source: Got It!
zh_hans: 明白了！

source: Hide
zh_hans: 隐藏

source: History Versions
zh_hans: 历史版本

source: Host
zh_hans: 主机

source: Icon Meanings
zh_hans: 图标含义

source: Image Viewer
zh_hans: 图片查看器

source: Import Status
zh_hans: 导入状态

source: Invalid URL: %@
zh_hans: 无效的 URL：%@

source: Item was not a URL and no error occurred.
zh_hans: 项目不是 URL，也没有发生错误。

source: Join:
zh_hans: 加入：

source: Keep
zh_hans: 保留

source: Keep Changes
zh_hans: 保留更改

source: Key
zh_hans: 键

source: Launch:
zh_hans: 启动：

source: Loading Prompts...
zh_hans: 加载提示词中...

source: Loading public shared creations...
zh_hans: 正在加载公共共享创作...

source: Loading...
zh_hans: 加载中...

source: Make Private
zh_hans: 设为私有

source: Make Public
zh_hans: 设为公开

source: Mine
zh_hans: 我的

source: Model
zh_hans: 模型

source: Models
zh_hans: 模型

source: Modified: %@
zh_hans: 修改时间: %@

source: My Prompts
zh_hans: 我的提示词

source: My Shared Prompts
zh_hans: 我分享的提示词

source: Name
zh_hans: 名称

source: Name can't be empty
zh_hans: 名称不能为空

source: New Prompt
zh_hans: 新建提示词

source: No bookmark data received.
zh_hans: 未收到书签数据。

source: No configured services available
zh_hans: 无可用的已配置服务

source: No custom prompts yet
zh_hans: 暂无自定义提示词

source: No data received for bookmark.
zh_hans: 未收到书签的数据。

source: No history available for this prompt except the latest version.
zh_hans: 此提示词除了最新版本外没有历史记录。

source: No image data provided to window.
zh_hans: 没有提供图片数据给窗口。

source: No matching prompts found
zh_hans: 未找到匹配的提示词

source: No prompts available
zh_hans: 没有可用的提示词

source: No result
zh_hans: 无结果

source: No Service Selected
zh_hans: 未选择服务

source: No URL selected or multiple URLs
zh_hans: 未选择 URL 或多个 URL

source: None
zh_hans: 无

source: Not Set
zh_hans: 未设置

source: Note: Dropped item is an alias or symbolic link. URL should be to the target if resolved from a bookmark.
zh_hans: 注意：拖放的项目是别名或符号链接。如果从书签解析，URL 应该指向目标。

source: OK
zh_hans: 确定

source: OpenAI Configuration
zh_hans: OpenAI 配置

source: Origin
zh_hans: 来源

source: Personal Prompt
zh_hans: 个人提示词

source: Please select a service from the list above.
zh_hans: 请从上方列表中选择一个服务。

source: Preview in Editor
zh_hans: 在编辑器中预览

source: Preview Prompt
zh_hans: 预览提示词

source: Previewing older version
zh_hans: 预览旧版本

source: Prompt
zh_hans: 提示词

source: Prompt can't be empty
zh_hans: 提示词不能为空

source: Prompt Comparison Test
zh_hans: 提示词对比测试

source: Prompt Content
zh_hans: 提示词内容

source: Prompt Content:
zh_hans: 提示词内容：

source: Prompt deleted successfully
zh_hans: 提示词删除成功

source: Prompt Name
zh_hans: 提示词名称

source: Prompt Published Successfully
zh_hans: 提示词发布成功

# prompt_template
source: **Please follow the steps below to optimize the user's prompt to make it clearer, more specific, and more effective:** 1. **Understand the Objective:** * Clearly identify what the user hopes to achieve with the prompt. * What type of information or output are they expecting? 2. **Analyze the Existing Prompt:** * Identify vague, ambiguous, or unclear wording in the prompt. * Check whether the prompt includes sufficient contextual information. 3. **Refine the Prompt:** * Use clear, concise, and specific language. * Provide necessary background information and context. * Clearly specify the desired format, length, and style. * Use keywords and phrases to guide the model. * If needed, include examples for clarification. 4. **Optimize the Prompt Structure:** * Break down complex prompts into smaller, more manageable steps. * Use lists, numbering, or indentation to improve readability. * Ensure the logical flow of the prompt is clear and easy to follow.
zh_hans: 请按照以下步骤优化用户提供的提示词，使其更清晰、具体、有效: 1. **理解目标：** * 明确用户希望通过提示词达到什么目的？ * 他们希望获得什么类型的信息或输出？ 2. **分析现有提示词：** * 识别提示词中模糊、含糊或不明确的措辞。 * 检查提示词中是否包含足够的上下文信息。 3. **完善提示词：** * 使用清晰、简洁、具体的语言。 * 提供必要的背景信息和上下文。 * 明确指定所需的格式、长度和风格。 * 使用关键词和短语来引导模型。 * 如果需要，可添加一些例子来说明。 4. **优化提示词结构：** * 将复杂的提示词分解为更小的、更易于管理的步骤。 * 使用列表、编号或缩进等格式来提高可读性。 * 确保提示词的逻辑流程清晰易懂。

source: PromptHub
zh_hans: 提示词中心

source: Public prompt
zh_hans: 公开提示词

source: Public Shared Prompt
zh_hans: 公开共享提示词

source: Publish
zh_hans: 发布

source: Quit
zh_hans: 退出

source: Quit Application?
zh_hans: 退出应用程序？

source: Quit PromptBox
zh_hans: 退出 PromptBox

source: Received image data directly. Implement loading from Data.
zh_hans: 直接接收到图片数据。实现从数据加载。

source: Refactor
zh_hans: 重构

source: Reset Images
zh_hans: 重置图片

source: Return to latest
zh_hans: 返回到最新版本

source: Review Changes
zh_hans: 审查更改

source: Run
zh_hans: 运行

source: Run Tests
zh_hans: 运行测试

source: Save
zh_hans: 保存

source: Search prompt...
zh_hans: 搜索提示词...

source: Search Prompt...
zh_hans: 搜索提示词...

source: Select All
zh_hans: 全选

source: Select Models
zh_hans: 选择模型

source: Service
zh_hans: 服务

source: Settings
zh_hans: 设置

source: Share
zh_hans: 分享

source: Share Link With Your Friends Now
zh_hans: 现在就与朋友分享链接吧

source: Share or Publish
zh_hans: 分享或发布

source: Share your favorite prompts with colleagues or friends in just one tap.
zh_hans: 只需一键即可与同事或朋友分享您喜爱的提示词。

source: Shared on %@
zh_hans: 分享于 %@

source: Shared Prompt
zh_hans: 共享提示词

source: Shared prompt (private)
zh_hans: 分享提示词（私有）

source: Shared: %@
zh_hans: 分享时间: %@

source: Show
zh_hans: 显示

source: Single Prompt Test
zh_hans: 单提示词测试

source: Source
zh_hans: 来源

source: Streaming...
zh_hans: 流式传输中...

source: Template
zh_hans: 模板

source: Test
zh_hans: 测试

source: Test Content
zh_hans: 测试内容

source: Test Failed
zh_hans: 测试失败

source: Test Prompt
zh_hans: 测试提示词

source: Test Result:
zh_hans: 测试结果：

source: Test Successful
zh_hans: 测试成功

source: Test your prompt across multiple models
zh_hans: 在多个模型上测试您的提示词

source: These services need API tokens to be used:
zh_hans: 这些服务需要 API 令牌才能使用：

source: Token
zh_hans: 令牌

source: Track Prompt Origins
zh_hans: 追踪提示词来源

source: Try using different keywords
zh_hans: 尝试使用不同的关键词

source: Unconfigured Services
zh_hans: 未配置的服务

source: Undo
zh_hans: 撤销

source: Undo Changes
zh_hans: 撤销更改

source: Unshared prompt
zh_hans: 未分享提示词

source: Updated: %@
zh_hans: 更新时间: %@

source: Version %@ Details
zh_hans: 版本 %@ 详情

source: Version %lld
zh_hans: 版本 %lld

source: Version %lld Details
zh_hans: 版本 %lld 详情

source: View in full screen
zh_hans: 全屏查看

source: Visual Prompt Previews
zh_hans: 可视化提示词预览

source: Welcome to PromptBox Version %@!
zh_hans: 欢迎使用PromptBox版本 %@！
